app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "u"], ["post_id", 1], ["created_at", "2017-10-31 15:33:57.194246"], ["updated_at", "2017-10-31 15:33:57.194246"]]
---
  def create
  @comment = Comment.create(comments_params)